clear all

n=1:10:1000;

clf;

q=9;     e=q*197*(1+0.6*exp(-((n-200).^2)/50^2)).*exp(-(n.^2)/200^2) + q*117; plot(n,e,'*-');
hold on
q=10;     e=q*197*(1+0.6*exp(-((n-200).^2)/50^2)).*exp(-(n.^2)/200^2) + q*117; plot(n,e,'*-');
q=13;    e=q*197*(1+0.3*exp(-((n-100).^2)/50^2)).*exp(-(n.^2)/200^2) + q*117; plot(n,e,'*-');
q=22;    e=q*197*(1+0.6*exp(-((n-300).^2)/50^2)).*exp(-(n.^2)/200^2) + q*117; plot(n,e,'*-');

xlabel('Количество итераций алгоритма (количество эпох)')
ylabel('Энергетические затраты на один цикр сбора данных, Дж')
grid on
title('Сенсорная сеть 10х10')

legend('12 часов','9 часов', '6 часов', '3 часа')
